# np.random_Practice
import numpy as np
# Задайте seed равным 2021
np.random.seed(2021)
# В simple сохраните случайное число в диапазоне от 0 до 1
simple = np.random.rand()
print(simple)
# 0.6059782788074047